In [39]:
import numpy as np
import pandas as pd

In [41]:
dataset = pd.read_csv('./dataset/Data.csv')
dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

# 透過這info()可以知道是否有nan

In [42]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
Country      10 non-null object
Age          9 non-null float64
Salary       9 non-null float64
Purchased    10 non-null object
dtypes: float64(2), object(2)
memory usage: 400.0+ bytes

# 使用dropna 刪除空值

In [56]:
new_dataset = dataset.dropna()
new_dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

# 因為刪除一些欄位了 所以要重新改index

In [57]:
new_dataset.reset_index(inplace = True, drop = True)
new_dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4   France  35.0  58000.0       Yes
5   France  48.0  79000.0       Yes
6  Germany  50.0  83000.0        No
7   France  37.0  67000.0       Yes

# split data 以及label

In [58]:
X = new_dataset.iloc[ : , :-1].values
Y = new_dataset.iloc[ : , 3].values

In [59]:
X

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['France', 35.0, 58000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

In [60]:
Y

array(['No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes'], dtype=object)

# one hot encoding

In [61]:
one_hot = pd.get_dummies(new_dataset['Country'])
one_hot

   France  Germany  Spain
0       1        0      0
1       0        0      1
2       0        1      0
3       0        0      1
4       1        0      0
5       1        0      0
6       0        1      0
7       1        0      0

# one hot encoding 的一種寫法

In [62]:
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
labelencoder_X = LabelEncoder()
X[ : , 0] = labelencoder_X.fit_transform(X[ : , 0])
X

array([[0, 44.0, 72000.0],
       [2, 27.0, 48000.0],
       [1, 30.0, 54000.0],
       [2, 38.0, 61000.0],
       [0, 35.0, 58000.0],
       [0, 48.0, 79000.0],
       [1, 50.0, 83000.0],
       [0, 37.0, 67000.0]], dtype=object)

# 另一種label map方法

In [74]:
label_mapping = {'Yes':1,'No':0}
np_Y = pd.DataFrame(Y)
np_Y.rename(columns={ np_Y.columns[0]: "label" }, inplace=True)
change_label = np_Y['label'].map(label_mapping)
change_label

0    0
1    1
2    0
3    0
4    1
5    1
6    0
7    1
Name: label, dtype: int64

In [51]:
onehotencoder = OneHotEncoder(categorical_features = [0])
X = onehotencoder.fit_transform(X).toarray()
labelencoder_Y = LabelEncoder()
Y =  labelencoder_Y.fit_transform(Y)

/home/letitgo/anaconda3/lib/python3.6/site-packages/sklearn/preprocessing/_encoders.py:363: FutureWarning: The handling of integer data will change in version 0.22. Currently, the categories are determined based on the range [0, max(values)], while in the future they will be determined based on the unique values.
If you want the future behaviour and silence this warning, you can specify "categories='auto'".
In case you used a LabelEncoder before this OneHotEncoder to convert the categories to integers, then you can now use the OneHotEncoder directly.
  warnings.warn(msg, FutureWarning)
/home/letitgo/anaconda3/lib/python3.6/site-packages/sklearn/preprocessing/_encoders.py:385: DeprecationWarning: The 'categorical_features' keyword is deprecated in version 0.20 and will be removed in 0.22. You can use the ColumnTransformer instead.
  "use the ColumnTransformer instead.", DeprecationWarning)

# 切割資料

In [24]:
from sklearn.model_selection import train_test_split
X_train, X_test, Y_train, Y_test = train_test_split( X , Y , test_size = 0.2, random_state = 0)

In [25]:
from sklearn.preprocessing import StandardScaler
sc_X = StandardScaler()
X_train = sc_X.fit_transform(X_train)
X_test = sc_X.transform(X_test)

StandardScaler 做某個範圍的縮小值，可以自己設定你想要的範圍，或者是透過均值，方差做scaler。
https://www.cnblogs.com/chaosimple/p/4153167.html

In [26]:
X_train

array([[-1.41421356,  0.        ,  1.41421356, -1.67447681, -1.61824072],
       [ 0.70710678,  0.        , -0.70710678, -0.17494534,  0.2836092 ],
       [-1.41421356,  0.        ,  1.41421356, -0.02499219, -0.31697499],
       [ 0.70710678,  0.        , -0.70710678,  0.87472669,  0.78409602],
       [ 0.70710678,  0.        , -0.70710678,  1.47453928,  1.48477757],
       [ 0.70710678,  0.        , -0.70710678, -0.47485163, -0.61726708]])